In [ ]:
#1 Establish a connection between Python and the Sakila database.

import pandas as pd
import numpy as np
import pymysql
from sqlalchemy import create_engine
import getpass  # To get the password without showing the input
password = getpass.getpass()


bd = "sakila"
connection_string = (f"mysql+pymysql://root:{password}@127.0.0.1:3307/{bd}")
engine = create_engine(connection_string)
engine

Engine(mysql+pymysql://root:***@127.0.0.1:3307/sakila)

In [ ]:
#2 Write a Python function called rentals_month that retrieves rental data for a given month and year (passed as parameters) from the Sakila database as a Pandas DataFrame. The function should take in three parameters:
#engine: an object representing the database connection engine to be used to establish a connection to the Sakila database.
#month: an integer representing the month for which rental data is to be retrieved.
#year: an integer representing the year for which rental data is to be retrieved.
#The function should execute a SQL query to retrieve the rental data for the specified month and year from the rental table in the Sakila database, and return it as a pandas DataFrame.
def rentals_month(con, month, year):
    from sqlalchemy import text

    with con as connection:
            query = text(f'SELECT * FROM rental WHERE YEAR(rental_date) = {year} AND MONTH(rental_date)={month}')
            result = connection.execute(query)
            rental_data = pd.DataFrame(result.all())
    return rental_data


connection = engine.connect()
rentals_month(connection,6,2005)

In [6]:

from sqlalchemy import text
with engine.connect() as connection:
    query = text('SELECT * FROM rental WHERE YEAR(rental_date) = 2005')
    result = connection.execute(query)
df = pd.DataFrame(result.all())
df

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
15857,16045,2005-08-23 22:25:26,772,14,2005-08-25 23:54:26,1,2006-02-15 21:30:53
15858,16046,2005-08-23 22:26:47,4364,74,2005-08-27 18:02:47,2,2006-02-15 21:30:53
15859,16047,2005-08-23 22:42:48,2088,114,2005-08-25 02:48:48,2,2006-02-15 21:30:53
15860,16048,2005-08-23 22:43:07,2019,103,2005-08-31 21:33:07,1,2006-02-15 21:30:53
15861,16049,2005-08-23 22:50:12,2666,393,2005-08-30 01:01:12,2,2006-02-15 21:30:53

In [11]:
df["month_year"] = df["rental_date"].dt.strftime("%Y-%m")
df

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,month_year
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,2005-05
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,2005-05
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,2005-05
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,2005-05
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,2005-05
...,...,...,...,...,...,...,...,...
15857,16045,2005-08-23 22:25:26,772,14,2005-08-25 23:54:26,1,2006-02-15 21:30:53,2005-08
15858,16046,2005-08-23 22:26:47,4364,74,2005-08-27 18:02:47,2,2006-02-15 21:30:53,2005-08
15859,16047,2005-08-23 22:42:48,2088,114,2005-08-25 02:48:48,2,2006-02-15 21:30:53,2005-08
15860,16048,2005-08-23 22:43:07,2019,103,2005-08-31 21:33:07,1,2006-02-15 21:30:53,2005-08
15861,16049,2005-08-23 22:50:12,2666,393,2005-08-30 01:01:12,2,2006-02-15 21:30:53,2005-08

In [20]:

#3 Develop a Python function called rental_count_month that takes the DataFrame provided by rentals_month as input along with the month and year and returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year.
#The function should also include the month and year as parameters and use them to name the new column according to the month and year, for example, if the input month is 05 and the year is 2005, the column name should be "rentals_05_2005".
#Hint: Consider making use of pandas groupby()


def rental_count_month(df, year, month):
    df["month_year"] = df["rental_date"].dt.strftime("%Y-%m")
    df2 = df[df["month_year"] == f"{year}-{month:02d}"]
    col_name = f"rentals_{month:02d}_{year}"
    new_df = df2.groupby("customer_id").agg(**{col_name:("rental_id","count")})
    return new_df

rental_count_month(df,2005,5)

             rentals_05_2005
customer_id
1                          2
2                          1
3                          2
5                          3
6                          3
...                      ...
594                        4
595                        1
596                        6
597                        2
599                        1

[520 rows x 1 columns]

In [22]:
df.columns[1]

'rental_date'

In [33]:

#4 Create a Python function called compare_rentals that takes two DataFrames as input containing the number of rentals made by each customer in different months and years. The function should return a combined DataFrame with a new 'difference' column, which is the difference between the number of rentals in the two months.

df5 = rental_count_month(df,2005,5)
df5.head()

             rentals_05_2005
customer_id
1                          2
2                          1
3                          2
5                          3
6                          3

In [32]:
df8 = rental_count_month(df,2005,8)
df8.head()

             rentals_08_2005
customer_id
1                         11
2                         11
3                          7
4                         11
5                         13

In [42]:
dif = pd.merge(df5,df8,how="outer",on="customer_id")
dif = dif.fillna(0)
dif

             rentals_05_2005  rentals_08_2005
customer_id
1                        2.0               11
2                        1.0               11
3                        2.0                7
4                        0.0               11
5                        3.0               13
...                      ...              ...
595                      1.0                8
596                      6.0               13
597                      2.0               12
598                      0.0                5
599                      1.0                7

[599 rows x 2 columns]

In [44]:

def compare_rentals(df1,df2):
    dif = pd.merge(df1,df2,how="outer",on="customer_id")
    dif = dif.fillna(0)
    dif["difference"] = dif[dif.columns[0]] - dif[dif.columns[1]]
    return dif

compare_rentals(df5,df8)

             rentals_05_2005  rentals_08_2005  difference
customer_id
1                        2.0               11        -9.0
2                        1.0               11       -10.0
3                        2.0                7        -5.0
4                        0.0               11       -11.0
5                        3.0               13       -10.0
...                      ...              ...         ...
595                      1.0                8        -7.0
596                      6.0               13        -7.0
597                      2.0               12       -10.0
598                      0.0                5        -5.0
599                      1.0                7        -6.0

[599 rows x 3 columns]